# INCLASS NOTEBOOK - DAY02

# -----------------------------  Introduction to Pandas    -----------------------------------

## Importing the `Pandas package`.

In [1]:
import pandas as pd #this will import pandas into your workspace

## `Data Structures` in pandas

There are two basic data structures in pandas: Series and DataFrame

## Series

It is similar to a NumPy 1-dimensional array. In addition to the values that are specified by the programmer, pandas attaches a label to each of the values. If the labels are not provided by the programmer, then pandas assigns labels ( 0 for first element, 1 for second element and so on). A benefit of assigning labels to data values is that it becomes easier to perform manipulations on the dataset as the whole dataset becomes more of a dictionary where each value is associated with a label.

## An example of  first python `series`.

In [2]:
series1 = pd.Series([10,20,30,40]) #we have used a list to create a series.
print(series1)

0    10
1    20
2    30
3    40
dtype: int64

## Printing the `values` that are there in the series

In [3]:
series1.values

array([10, 20, 30, 40])

## Figuring out the `index numbers` that are there in the series

In [6]:
print(series1.index) #This would print the starting index and ending index
for i in series1.index:
    print(series1[i])

RangeIndex(start=0, stop=4, step=1)
10
20
30
40

## Specifying `custom index values` rather than the default ones provided, you can do so using the following command.

In [7]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
series2

one      10
two      20
three    30
four     40
five     50
dtype: int64

In [0]:
# Lets print the element which is there in the position 2

In [8]:
series2[2]

30

## Lets retrive the element using `index number`.

In [9]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
print(series2)
series2['three']

one      10
two      20
three    30
four     40
five     50
dtype: int64

30

## Lets access multiple elements.

In [10]:
series2[['one', 'three', 'five']]

one      10
three    30
five     50
dtype: int64

## Lets `add "4" `to each element of the series (math operations)

In [11]:
series2 + 4

one      14
two      24
three    34
four     44
five     54
dtype: int64

## Lets `subset` the entire series whose value is greater than 30

In [12]:
series2[series2>30]

four    40
five    50
dtype: int64

## Data Frame

DataFrame is a tabular data structure in which data is laid out in rows and column format (similar to a CSV or tables in SQL file), but it can also be used for higher dimensional data sets. The DataFrame object can contain homogenous and heterogenous values, and can be thought of as a logical extension of Series data structures. In contrast to Series, where there is one index, a DataFrame object has one index for column and one index for rows. This allows flexibility in accessing and manipulating data.

## Lets `create` a Data Frame with multiple columns called Price, Ticker and Company.

In [13]:
data = pd.DataFrame({'price':[95, 25, 85, 41, 78],
                     'ticker':['AXP', 'CSCO', 'DIS', 'MSFT', 'WMT'],
                     'company':['American Express', 'Cisco', 'Walt Disney','Microsoft', 'Walmart']})
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft
4     78    WMT           Walmart

#Note: If a column is passed with no values, it will simply have NaN values

## How to access a `specific column` from the data frame?

In [14]:
data['company']

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

## How to access a `specific row` from the data frame?

In [60]:
data.ix[2] #Will print all the elements of second row

price               85
ticker             DIS
company    Walt Disney
Year              2014
Name: 2, dtype: object

#Note: ix is the shortform form for index.

## How to `add` a new column in the data frame?

In [16]:
data['Year'] = 2014
data

   price ticker           company  Year
0     95    AXP  American Express  2014
1     25   CSCO             Cisco  2014
2     85    DIS       Walt Disney  2014
3     41   MSFT         Microsoft  2014
4     78    WMT           Walmart  2014

## How to create a column and populate it with `missing values(NaN) `?

In [17]:
data['delta_col'] = 'NaN'
data

   price ticker           company  Year delta_col
0     95    AXP  American Express  2014       NaN
1     25   CSCO             Cisco  2014       NaN
2     85    DIS       Walt Disney  2014       NaN
3     41   MSFT         Microsoft  2014       NaN
4     78    WMT           Walmart  2014       NaN

## How to `delete` a column

In [18]:
# del data['name_of_the_col_to_delete']

del data['delta_col']
print(data)

   price ticker           company  Year
0     95    AXP  American Express  2014
1     25   CSCO             Cisco  2014
2     85    DIS       Walt Disney  2014
3     41   MSFT         Microsoft  2014
4     78    WMT           Walmart  2014

## How to `drop` a column?

In [19]:
newdata = data.drop(2)
print(newdata)

   price ticker           company  Year
0     95    AXP  American Express  2014
1     25   CSCO             Cisco  2014
3     41   MSFT         Microsoft  2014
4     78    WMT           Walmart  2014

## How to do a `transpose` of a dataframe?

In [20]:
dft = data.T #Transpose operation will interchange the rows and columns
dft

                        0      1            2          3        4
price                  95     25           85         41       78
ticker                AXP   CSCO          DIS       MSFT      WMT
company  American Express  Cisco  Walt Disney  Microsoft  Walmart
Year                 2014   2014         2014       2014     2014

## Indexing

In [24]:
df1= data.ix[:,'price']
df1

0    95
1    25
2    85
3    41
4    78
Name: price, dtype: int64

In [25]:
#based on row and column
data.ix[3,2]

'Microsoft'

## Indexing with `iloc`:

In [26]:
# select first 2 rows
data.iloc[:2]
# or
data.iloc[:2,]

   price ticker           company  Year
0     95    AXP  American Express  2014
1     25   CSCO             Cisco  2014

In [27]:
# select 3rd to 5th rows
data.iloc[2:5]
# or 
data.iloc[2:5,]

   price ticker      company  Year
2     85    DIS  Walt Disney  2014
3     41   MSFT    Microsoft  2014
4     78    WMT      Walmart  2014

## Select column by using column number in pandas with `.iloc`.

In [28]:
# select first 2 columns
data.iloc[:,:2]

   price ticker
0     95    AXP
1     25   CSCO
2     85    DIS
3     41   MSFT
4     78    WMT

In [29]:
# select 1st and 4thcolumn
data.iloc[:,[0,3]]

   price  Year
0     95  2014
1     25  2014
2     85  2014
3     41  2014
4     78  2014

## indexing with `loc` :

In [30]:
# select row by row name
data.loc[1]

price         25
ticker      CSCO
company    Cisco
Year        2014
Name: 1, dtype: object

In [31]:
# select value by row label and column label using loc
 
data.loc[[1,2,3,4,5],['price','ticker']]

   price ticker
1   25.0   CSCO
2   85.0    DIS
3   41.0   MSFT
4   78.0    WMT
5    NaN    NaN

## How to `reindex` the data?

In [32]:
new_data = data.reindex(index=[0,2], columns=['company', 'price'])
print(new_data)

            company  price
0  American Express     95
2       Walt Disney     85

In [34]:
#Note: reindex with only row arguments i.e we want row 88, 89 etc from above df2
reindexdf2 = df2.reindex([88,89,90,91,92,93,94,95,96,97,98], fill_value=0)
reindexdf2

    Firm1  Firm2  Firm3
88      0      0      0
89      0      0      0
90      8     14      8
91      9     12      9
92      7      9      9
93      8     13     10
94      9      5     12
95     11      8     13
96      0      0      0
97      0      0      0
98      0      0      0

The reason we have zeros is due to the fact that row 88, 89, 86,97 and 97 are
not present in our original data frame df2

## `Drop` the `duplicate row` of a dataframe

In [35]:
import pandas as pd
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','jodha','jack','raghu','Cathrine',
            'Alisa','Bobby','kumar','Alisa','Alex','Cathrine'],
    'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
      
    'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}
 
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

        Name  Age  Score
0      Alisa   26     85
1      Bobby   24     63
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
6      Alisa   26     85
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

## Drop the `duplicate rows`:

In [36]:
df.drop_duplicates()

        Name  Age  Score
0      Alisa   26     85
1      Bobby   24     63
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89

## `Drop` the duplicate by `retaining last occurrence`:

In [37]:
df.drop_duplicates(keep='last')

        Name  Age  Score
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
6      Alisa   26     85
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

## `Drop` the duplicate by `column`:

In [38]:
df.drop_duplicates(['Name'], keep='last')

        Name  Age  Score
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

## Simply `drop a row` or observation:

In [39]:
df.drop([1,2])

        Name  Age  Score
0      Alisa   26     85
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
6      Alisa   26     85
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

## Drop a row or observation by condition:

In [40]:
df[df.Name != 'Alisa']

        Name  Age  Score
1      Bobby   24     63
2      jodha   23     55
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
7      Bobby   24     63
8      kumar   22     42
10      Alex   24     89
11  Cathrine   24     77

The above code takes up all the names except Alisa, thereby dropping the row with name Alisa.

## Drop a row or observation by `index`:

In [41]:
df.drop(df.index[2])

        Name  Age  Score
0      Alisa   26     85
1      Bobby   24     63
3       jack   22     74
4      raghu   23     31
5   Cathrine   24     77
6      Alisa   26     85
7      Bobby   24     63
8      kumar   22     42
9      Alisa   23     62
10      Alex   24     89
11  Cathrine   24     77

## Drop the row by `position`:

In [42]:
# Drop bottom 3 rows
df[:-3]

       Name  Age  Score
0     Alisa   26     85
1     Bobby   24     63
2     jodha   23     55
3      jack   22     74
4     raghu   23     31
5  Cathrine   24     77
6     Alisa   26     85
7     Bobby   24     63
8     kumar   22     42

## Drop a `column by name`:

In [43]:
# drop a column based on name
 
df.drop('Age',axis=1)

        Name  Score
0      Alisa     85
1      Bobby     63
2      jodha     55
3       jack     74
4      raghu     31
5   Cathrine     77
6      Alisa     85
7      Bobby     63
8      kumar     42
9      Alisa     62
10      Alex     89
11  Cathrine     77

## Drop a column based on `column index`:

In [44]:
# drop a column based on column index
 
df.drop(df.columns[2],axis=1)

        Name  Age
0      Alisa   26
1      Bobby   24
2      jodha   23
3       jack   22
4      raghu   23
5   Cathrine   24
6      Alisa   26
7      Bobby   24
8      kumar   22
9      Alisa   23
10      Alex   24
11  Cathrine   24

## `Delete` a column based on `column name`:

In [45]:
# delete a column
 
del df['Age']
df

        Name  Score
0      Alisa     85
1      Bobby     63
2      jodha     55
3       jack     74
4      raghu     31
5   Cathrine     77
6      Alisa     85
7      Bobby     63
8      kumar     42
9      Alisa     62
10      Alex     89
11  Cathrine     77

## `sort` a dataframe in python

In [48]:
import pandas as pd

#Create a Dictionary of series
d = {'Name':pd.Series(['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa']),
   'Age':pd.Series([26,27,25,24,31,27,25,33,42,32,51,47]),
   'Score':pd.Series([89,87,67,55,47,72,76,79,44,92,99,69])}
 
#Create a DataFrame
df2 = pd.DataFrame(d)
print (df2)

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

## `Sort` the python pandas Dataframe by single column  `Ascending order`:

In [49]:
# sort the pandas dataframe by ascending value of single column
 
df2.sort_values(by='Score')

         Name  Age  Score
8       David   42     44
4       Rocky   31     47
3     Madonna   24     55
2    Cathrine   25     67
11     Teresa   47     69
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
1       Bobby   27     87
0       Alisa   26     89
9      Andrew   32     92
10       Ajay   51     99

## `Sort` a Dataframe in python pandas by single Column  `descending order`.

In [50]:
df2.sort_values(by='Score',ascending=0)

         Name  Age  Score
10       Ajay   51     99
9      Andrew   32     92
0       Alisa   26     89
1       Bobby   27     87
7       Rahul   33     79
6    Jaqluine   25     76
5   Sebastian   27     72
11     Teresa   47     69
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
8       David   42     44

## `Sort` the pandas Dataframe by Multiple Columns

In [51]:
# sort the pandas dataframe by multiple columns
 
df2.sort_values(by=['Age', 'Score'],ascending=[True,False])

         Name  Age  Score
3     Madonna   24     55
6    Jaqluine   25     76
2    Cathrine   25     67
0       Alisa   26     89
1       Bobby   27     87
5   Sebastian   27     72
4       Rocky   31     47
9      Andrew   32     92
7       Rahul   33     79
8       David   42     44
11     Teresa   47     69
10       Ajay   51     99

## Sort the dataframe in python pandas by index in ascending order:

In [52]:
df3=df2.sort_index()
df3

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

## `Rank` the dataframe in python

In [53]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
'History','History','History','Economics','Economics','Economics'],
'Score':[62,47,55,74,31,77,85,63,42,62,89,85]}
 
df4 = pd.DataFrame(d,columns=['Name','Subject','Score'])
df4

        Name      Subject  Score
0      Alisa  Mathematics     62
1      Bobby  Mathematics     47
2   Cathrine  Mathematics     55
3      Alisa      Science     74
4      Bobby      Science     31
5   Cathrine      Science     77
6      Alisa      History     85
7      Bobby      History     63
8   Cathrine      History     42
9      Alisa    Economics     62
10     Bobby    Economics     89
11  Cathrine    Economics     85

## `Ranking` the dataframe in python pandas on `ascending order`:

In [0]:
# Ranking of score ascending order
 
df4['score_ranked']=df['Score'].rank(ascending=1)
df4

        Name      Subject  Score  score_ranked
0      Alisa  Mathematics     62          10.5
1      Bobby  Mathematics     47           5.5
2   Cathrine  Mathematics     55           3.0
3      Alisa      Science     74           7.0
4      Bobby      Science     31           1.0
5   Cathrine      Science     77           8.5
6      Alisa      History     85          10.5
7      Bobby      History     63           5.5
8   Cathrine      History     42           2.0
9      Alisa    Economics     62           4.0
10     Bobby    Economics     89          12.0
11  Cathrine    Economics     85           8.5

## `Ranking` the dataframe in python pandas on `descending order`.

In [0]:
df4['score_ranked']=df['Score'].rank(ascending=0)
df4

        Name      Subject  Score  score_ranked
0      Alisa  Mathematics     62           2.5
1      Bobby  Mathematics     47           7.5
2   Cathrine  Mathematics     55          10.0
3      Alisa      Science     74           6.0
4      Bobby      Science     31          12.0
5   Cathrine      Science     77           4.5
6      Alisa      History     85           2.5
7      Bobby      History     63           7.5
8   Cathrine      History     42          11.0
9      Alisa    Economics     62           9.0
10     Bobby    Economics     89           1.0
11  Cathrine    Economics     85           4.5

## `Rank` the dataframe in python pandas by `minimum value` of the rank.

In [0]:
df4['score_ranked']=df['Score'].rank(ascending=0,method='min')
df4

        Name      Subject  Score  score_ranked
0      Alisa  Mathematics     62           2.0
1      Bobby  Mathematics     47           7.0
2   Cathrine  Mathematics     55          10.0
3      Alisa      Science     74           6.0
4      Bobby      Science     31          12.0
5   Cathrine      Science     77           4.0
6      Alisa      History     85           2.0
7      Bobby      History     63           7.0
8   Cathrine      History     42          11.0
9      Alisa    Economics     62           9.0
10     Bobby    Economics     89           1.0
11  Cathrine    Economics     85           4.0

## Rank the dataframe in python pandas by `dense rank`.

In [0]:
df4['score_ranked']=df['Score'].rank(ascending=0,method='dense')
df4

        Name      Subject  Score  score_ranked
0      Alisa  Mathematics     62           2.0
1      Bobby  Mathematics     47           5.0
2   Cathrine  Mathematics     55           7.0
3      Alisa      Science     74           4.0
4      Bobby      Science     31           9.0
5   Cathrine      Science     77           3.0
6      Alisa      History     85           2.0
7      Bobby      History     63           5.0
8   Cathrine      History     42           8.0
9      Alisa    Economics     62           6.0
10     Bobby    Economics     89           1.0
11  Cathrine    Economics     85           3.0

#Dense rank does not skip any rank (in min and max ranks are skipped)

## Rank the dataframe in python pandas by `Group`.

In [0]:
df4["group_rank"] = df4.groupby("Subject")["Score"].rank(ascending=0,method='dense')
df4

        Name      Subject  Score  score_ranked  group_rank
0      Alisa  Mathematics     62           2.0         1.0
1      Bobby  Mathematics     47           5.0         3.0
2   Cathrine  Mathematics     55           7.0         2.0
3      Alisa      Science     74           4.0         2.0
4      Bobby      Science     31           9.0         3.0
5   Cathrine      Science     77           3.0         1.0
6      Alisa      History     85           2.0         1.0
7      Bobby      History     63           5.0         2.0
8   Cathrine      History     42           8.0         3.0
9      Alisa    Economics     62           6.0         3.0
10     Bobby    Economics     89           1.0         1.0
11  Cathrine    Economics     85           3.0         2.0

## Hierarchical indexing or multiple indexing in python

In [54]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
d = {
    'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df5 = pd.DataFrame(d,columns=['Name','Exam','Subject','Score'])
df5

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1      Bobby  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4      Bobby  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7      Bobby  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10     Bobby  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [55]:
df6=df5.set_index(['Exam', 'Subject'])
df6

                            Name  Score
Exam       Subject
Semester 1 Mathematics     Alisa     62
           Mathematics     Bobby     47
           Mathematics  Cathrine     55
           Science         Alisa     74
           Science         Bobby     31
           Science      Cathrine     77
Semester 2 Mathematics     Alisa     85
           Mathematics     Bobby     63
           Mathematics  Cathrine     42
           Science         Alisa     67
           Science         Bobby     89
           Science      Cathrine     81

In [56]:
# View index
df6.index

MultiIndex(levels=[['Semester 1', 'Semester 2'], ['Mathematics', 'Science']],
           codes=[[0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1], [0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1]],
           names=['Exam', 'Subject'])

## `Swap` the column in the `hierarchical index`:

In [58]:
df6.swaplevel('Subject','Exam')

                            Name        Exam      Subject  Score
Subject     Exam
Mathematics Semester 1     Alisa  Semester 1  Mathematics     62
            Semester 1     Bobby  Semester 1  Mathematics     47
            Semester 1  Cathrine  Semester 1  Mathematics     55
Science     Semester 1     Alisa  Semester 1      Science     74
            Semester 1     Bobby  Semester 1      Science     31
            Semester 1  Cathrine  Semester 1      Science     77
Mathematics Semester 2     Alisa  Semester 2  Mathematics     85
            Semester 2     Bobby  Semester 2  Mathematics     63
            Semester 2  Cathrine  Semester 2  Mathematics     42
Science     Semester 2     Alisa  Semester 2      Science     67
            Semester 2     Bobby  Semester 2      Science     89
            Semester 2  Cathrine  Semester 2      Science     81

## `Hierarchical indexing` or `multiple indexing` in python pandas without dropping:

In [57]:
df6=df5.set_index(['Exam', 'Subject'],drop=False)
df6

                            Name        Exam      Subject  Score
Exam       Subject
Semester 1 Mathematics     Alisa  Semester 1  Mathematics     62
           Mathematics     Bobby  Semester 1  Mathematics     47
           Mathematics  Cathrine  Semester 1  Mathematics     55
           Science         Alisa  Semester 1      Science     74
           Science         Bobby  Semester 1      Science     31
           Science      Cathrine  Semester 1      Science     77
Semester 2 Mathematics     Alisa  Semester 2  Mathematics     85
           Mathematics     Bobby  Semester 2  Mathematics     63
           Mathematics  Cathrine  Semester 2  Mathematics     42
           Science         Alisa  Semester 2      Science     67
           Science         Bobby  Semester 2      Science     89
           Science      Cathrine  Semester 2      Science     81

-----------------

# ---------------------------------------HAPPY LEARNING-------------------------------------------

 ---------------------------